package student.inter;

public interface StudentOutput {
      void print();
      default void frame(){
            System.out.println("**********************************************************************************************************\n");
            System.out.println("                                         ## 학사 관리 시스템 : 데이터 출력 ##                                         ");
            System.out.println("\n**********************************************************************************************************");
            System.out.println("\t학번\t\t이름\t\t국어\t\t영어\t\t수학\t\t과학\t\t합계\t\t평균\t\t학점");
            System.out.println("**********************************************************************************************************");

      }

}
